{"id":"09344ca2-fdcc-4de3-9424-1b201e3da9ea","content":"Tim Ernst grew up in Williamsville playing video games like “Mega Man” and “The Legend of Zelda” on his console, and “Ultima” and “Warcraft”... Read… \r \nTim Ernst grew up in Williamsville playing video games like “Mega Man” and “The Legend of Zelda” on his console, and “Ultima” and “Warcraft” on his computer. \n\n“I loved them. They were something I just saw so much potential in,” Ernst said. “It was always heartbreaking to play a game that was terrible. And if you played one that was amazing, it was just an unbelievable experience. \n\n” \n\nToday, he gets to play – and design, and develop – video games for a living. Ernst, 34, is general manager of Kabam Games, where he oversees about 100 employees in the company’s San Francisco development studio. \n\nHe’s playing a leading role in the company’s latest mobile game, “Star Wars: Uprising,” which came out Thursday and is tied to the eagerly awaited next installment in the “Star Wars” movie franchise, set for release in December. \n\nKabam has found a niche in making interactive, role-playing games for smartphones and tablets. The games are free to download and play but offer users the chance to pay for additional items within the game. \n\nIt’s one segment of the massive, highly competitive video-game market, in which Ernst got his start with an internship at Ubisoft while studying at Yale University. He later worked at Sega of America and Bedlam Games before joining Kabam four years ago. \n\nThe Canisius High School graduate spoke to The News during a recent trip to Western New York, where he visited family and tried to squeeze in stops at Duff’s Famous Wings, Gabriel’s Gate, Mighty Taco, Wegmans and other hometown favorites. \n\nQ: Is making video games work? \n\nA: Clearly we’re not just playing games. We, to a certain extent, do rocket science inside of video games. But it’s sure enjoyable – it’s an industry full of passionate people. \n\nQ: Kabam’s niche is in role-playing games, or RPGs, for mobile devices. What are they? \n\nA: A role-playing game is really a video game world. It’s got to be complete, with people you talk to, a story. But your character, your customization, your choices, as well as how you interact with both people in the game, and other people playing the game, is what makes the genre unique. \n\nQ: Are role-playing games a small part of the market compared to console and PC games? \n\nA: No, it is it not a small segment of the overall industry. In fact, multiple games last year made over $1 billion themselves. So, there has been success. And the people that have been successful have stayed at the top for a long period of time. It’s also a growth market because of international – specifically China. China’s a huge market that console games, traditional games, have not been able to break into. \n\nQ: How do you provide the immersed gaming experience you get from playing on a desktop or console to people playing on their phones? \n\nA: That’s one of the things that we’re trying to pioneer. We just released a game seven months ago called “Marvel: Contest of Champions,” which is a fighting game that had some light story elements. And really it’s about making it a game – it’s not a mobile game being an apology. So we’re trying to push more the true, classic video game experiences inside of a phone. And that does mean that if we’re making an RPG (role playing game), we have to tell our story a little differently – our pacing’s very different. \n\nQ: “Star Wars: Uprising” will be free to download and play. How does Kabam make money through the game? \n\nA: The basis of free to play is everybody can download it because we want as many people as possible to start playing it. And, really, the core of free play is being able to offer people what we call “pay against the grind.” So if you want to do something in the game, and it’s going to take you a couple of extra hours – it’s not like a timer, but let’s say I have to run 10 dungeons – there’s a route to kind of make that a lot shorter. It’s optional. \n\nQ: How does the game fit within the “Star Wars” storyline? \n\nA: “Star Wars: Uprising” is set in the Anoat Sector, which you could call the “Empire Strikes Back” sector. So it’s Hoth, Cloud City, the planets around there. And it’s right after “Return of the Jedi.” So this is time that nobody has explored in games. Basically, after the emperor, Death Star II, and the emperor is killed, the governor of the system, Governor Adelhard, basically puts an iron blockade down. Now, he’s an imperialist. He believes that what the Empire’s doing is truly great for the galaxy. And he puts a blockade that prevents trade, that prevents rebel propaganda. But ultimately you’re pushing back against Adelhard’s iron blockade. And there’s five factions. The Rebel Alliance is one of the factions. \n\nQ: Is it completely open-ended, or is there a way to win the game? \n\nA: I don’t know that there’s winning, because it’s a living world. But clearly you want to win, you want to beat the Empire. And we don’t really look at it as just a game or a packaged product. This is a service, and we want to create the Star Wars community, the place for everyone to live their “Star Wars” dream. So how you push back against the Empire is part of the game, and one of the parts that will evolve. And as the community reacts, t…","title":"A video game fan brings ‘Star Wars’ to your smartphone","media-type":"News","source":"MyInforms","published":"2015-09-13T02:09:48Z"}
{"id":"87bc19b8-57df-4111-bf63-a39fcb8ad1a1","content":"Country music sort of lives in this bubble, and everyone is a little bit scared to poke that… \r \nBy Sarah Boesveld September 14, 2015 12:09 PM \n\nThe country radio DJ pauses before biting the bullet: “Has anyone been like ‘What the hell are you doing?'” she asks. \n\n“Every single day,” Thomas Rhett says without missing a beat. \n\nA half hour earlier, a dozen industry types, seated before a massive control board and a big cake sheet lined with strawberries, bopped their heads to Rhett’s “progressive” country record — one marketed to lead a sonic shift in a genre of which they are still the gatekeepers. \n\n“Oooh, you look so dang hot in my T-shirt” thumps one track — titled T-shirt, appropriately enough — that likens the girl in the song to a model in a Guns ‘N Roses video. “Pour a little liquor in my coconut water” repeats the infectious hook of Vacation. There’s a rap interlude from Lunch Money Lewis; a sexy duet with pop star Jordin Sparks. \n\nThe artist blaring from the speakers sat just outside the listening session — too nervous, he said, to watch people take in tracks from his sophomore album ‘Tangled Up.’ He strides in when it’s over, bedroom eyes scanning the room for a reaction. \n\n“It’s fun,” the group initially declares before the question on everyone’s mind gets asked. \n\nThe son of 90’s country singer and Nashville songwriter Rhett Akins, Rhett made his debut in 2013 with ‘bro’ songs like ‘Get Me Some of That’ and ‘It Goes Like This’ — his star seemingly reliant on the dirt road theme of the day. But in the past year, Rhett’s undergone a metamorphosis: first with his BeeGees-inspired ‘Make Me Wanna’ and then with ‘Crash & Burn,’ the Sam Cooke-style debut single off a forthcoming record that marries soul, pop, disco, electronic dance music (EDM) and a dash of rap with what’s typically known as country. \n\nThe single Rhett was terrified to release has since become his fastest rising, biggest selling song. And nestled in the Country Billboard Top 10 this summer betwixt hits like Sam Hunt’s party-hearty ‘House Party’ and ‘Like a Wrecking Ball,’ the soulful sex-jam from Erich Church, his risk at least feels of the moment. There is comfort in acknowledging the chart-busting success of genre-blurring acts like Florida Georgia Line (who Rhett has supported on tour), Luke Bryan and Hunt, whose nearly pure-pop and R&B debut album has made him something of a (controversial) pioneer. \n\n“It’s very liberating” Rhett said in an interview, reflecting on his move away from “bro” and towards something entirely new. “Someone the other day was like ‘Man, I don’t know if you know this, but I feel like you’re on the brink of leading a new direction of music. \n\n’” \n\nBut in the minds of traditionalists, a new direction isn’t something to which a country musician should aspire. To guys like Kyle Coroneos, who runs the website SavingCountryMusic.com, country is a genre not to be tampered with. Country music is about preserving tradition. It always has been and always will be. \n\nHe calls this disco\/EDM iteration a “bro-hangover.” The idea that bringing other genre-influences into country right now is risky, or pushing the envelope, or taking the genre somewhere new and exciting is disingenuous, he says. Instead, it contributes to one giant “mono-genre,” which he believes the merging of hip-hop and country has become. \n\n“The risk for country music is when you start going this far out of your boundaries, you begin to lose control of the music, you begin to lose control of your identity,” he said. “Country music is unique because it has so much of its own infrastructure and traditions — no other genre of music has four major awards shows every year, not even rock or EDM or rap. \n\n” \n\nThe genre-blending and trend-chasing is exactly the fate that befell rock radio, he said. “In the 1990s and early 2000s, rock became the catch-all phrase,” he said. “What happened was it lost its identity and it sort of imploded. I think it could happen” with country music. \n\nRhett doesn’t believe his music is going to cause the downfall of country music. “We’re one of those genres that sort of lives in this bubble that everyone is a little bit scared to poke that bubble, because we’re worried about what will happen when that bubble breaks,” said Rhett. “To me, I want to be that artist that when my buddies are watching me side-stage, they’ll say ‘Dang, I can’t believe they just did that in their concert.’ Or they hear a song on the record and go ‘How in the world did they cut that song and get away with it?’ There’s something kind of rebelliously fun about it. \n\n” \n\nHe cites mainstream country rebel Church as inspiration, his latest rock-influenced record ‘The Outsiders’ is stacked with successful radio hits, despite its many middle-finger-to-the-man moments. But in the minds of critics, that rebelliousness is a far cry from the stuff of Willie & Waylon and more indicative of Nashville chasing the next biggest money-making thing. \n\nDespite all of the pop experimentation, the country music genre lives in two stubborn solitudes: There’s ‘real’ country and there’s that crap you hear on the radio. But if you’re going to refer to something as ‘real’ country, you have to have a definition of what ‘real’ country is. \n\nIf Thomas Rhett wants to put out an album in the style of Bruno Mars and have EDM and R&B stuff … I am 100% for it. You go, Thomas Rhett. You do that. But don’t do it and sell it to country fans \n\nCountry music’s identity is very much rooted in geography — there’s Texas Swing out of the Lone Star State; there’s Kentucky bluegrass, there’s The Bakersfield Sound in California, which was a grittier, more direct response to the slick sounds coming out of Countrypolitan Nashville. \n\nPerhaps the current outcry of traditionalists is a little reminiscent of the origins of rock ‘n’ roll — the combination of blues, country and gospel broke all the rules in the 1950s and pushed so many gatekeeper buttons. While Rhett’s hip gyrations are the closest he’ll ever get to Elvis, maybe his Bruno Mars covers are indeed pushing the boundaries in a good way — reminding the country music world that nothing ever new or interesting has come from colouring inside the lines. \n\nAnd if there would be no rock ‘n roll without blues, country and gospel, there would be no co…","title":"Thomas Rhett pulls a Swift: Is country music still country music when rap, soul and EDM are included?","media-type":"News","source":"MyInforms","published":"2015-09-14T16:24:01Z"}
{"id":"bd45307a-2589-410e-a327-ee7fd2144668","content":"NASA mistakes the moon for the sun in a Tweet, prompting a flurry of social media ridicule and eventually, a… NASA mistakes the moon for the sun in a Tweet, prompting a flurry of social media ridicule and eventually, a correction. \n\nNASA mistakes the moon for the…","title":"NASA can't tell the difference between the sun and the moon","media-type":"News","source":"MyInforms","published":"2015-09-10T12:54:35Z"}
{"id":"cb85f346-a961-4e3d-8942-3d2a0e436a85","content":"Chinese giant Baidu is getting in on the phone personal assistant game with the launch of Duer, marking a major improvement on the previous system launched on the Baidu app three years ago.\nThe post appeared first on Silicon… \r \nChinese giant Baidu is getting in on the phone personal assistant game with the launch of Duer, marking a major improvement on the previous system launched on the Baidu app three years ago. \n\nBaidu’s Duer, which effectively translates to ‘Du Secretary’ was given a major demonstration with aims of using artificial intelligence (AI) and machine learning to challenge the systems developed by Apple and Google. \n\nMuch has been made of its development considering that one of the driving forces behind its machine learning technology is world-renowned expert in the field, Andrew Ng, who joined the company back in 2014. \n\nMuch like its competitors, Baidu’s Duer is working towards allowing the user to place orders online with services like buying cinema tickets or ordering takeaway food. \n\nAccording to Tech In Asia, this first step into AI will be expanded into allowing for other services including hailing a taxi and ordering other online goods. \n\nPerhaps most interestingly, it is hoped Duer will engage with the internet of things (IoT) home by allowing it to control devices in the home as well as connect them with a healthcare provider. \n\nWhen talking about Duer and its capabilities, Baidu…","title":"Baidu take on Siri and Google Now with Duer AI assistant","media-type":"News","source":"MyInforms","published":"2015-09-09T09:30:29Z"}
{"id":"f8a65c25-08bb-4b1a-b0a3-9f7994eb33a3","content":"President Barack Obama weighed in on House Speaker John Boehner's (R-Ohio) resignation Friday, praising him as a \"good man\" and urging his successor to avoid a government shutdown. Obama, noting that the resignation took him by surprise, said he spoke to Boehner on the phone after hearing the news. \"John Boehner is a good man,\" Obama said. \"He is a patriot, he cares deeply about the House, an institution in which he has served for a long time, he cares about his constituents and he… \r \nPresident Barack Obama weighed in on House Speaker John Boehner's (R-Ohio) resignation Friday, praising him as a \"good man\" and urging his successor to avoid a government shutdown. \n\nObama, noting that the resignation took him by surprise, said he spoke to Boehner on the phone after hearing the news. \n\n\"John Boehner is a good man,\" Obama said. \"He is a patriot, he cares deeply about the House, an institution in which he has served for a long time, he cares about his constituents and he cares about America.\" \n\nObama continued: \"We obviously have had a lot of disagreements, and politically we're at different ends of the spectrum, but I will tell you he has always conducted himself with courtesy and civility with me. He has kept his word when he has made a commmitment. He is somebody who has been gracious, and I think maybe most importantly is somebody who understands that in governance, you don't get 100 percent of what you want, but you have to work with people who you disagree with, sometime strongly, in order to do the people's business.\" \n\nObama said he would not \"prejudge\" the next House speaker and what his relationship might be like with him or her, but warned Boehner's future replacement against shutting down the government. \n\n\"My hope is there's a recognition on the part of the next speaker, something I think John understood though at times it was challenging to bring his caucus along, that we can have significant differences on issues but that doesn't mean you shut down the government, that doesn't mean you risk the full faith and…","title":"Obama Praises John Boehner For His Service Despite 'Disagreements'","media-type":"News","source":"MyInforms","published":"2015-09-25T17:26:14Z"}
{"id":"ecc20144-2d65-43cb-adab-9a9f6559f4f6","content":"N+1 Singer reiterated their hold rating on shares of Carclo plc (LON:CAR) in a report issued on Thursday morning, Analyst Ratings Net reports. They currently have a GBX 148 ($2.28) price objective on the stock. Separately, Peel Hunt reiterated a buy rating and issued a GBX 180 ($2.77) price target on shares of Carclo plc… \r \nN+1 Singer reiterated their hold rating on shares of Carclo plc (LON:CAR) in a report issued on Thursday morning, Analyst Ratings Net reports. They currently have a GBX 148 ($2.28) price objective on the stock. \n\nSeparately, Peel Hunt reiterated a buy rating and issued a GBX 180 ($2.77) price target on shares of Carclo plc in a research note on Wednesday, June 17th. \n\nShares of Carclo plc (LON:CAR) opened at 148.94 on Thursday. Carclo plc has a 1-year low of GBX 80.00 and a 1-year high of GBX 169.75. The firm’s 50 day moving average price is GBX 144.51 and its 200-day moving average price is GBX 143.07. The company’s market capitalization is GBX 98.59 million. \n\nThe firm also recently declared a dividend, which will be paid on Friday, October 2nd. Shareholders of record on Thursday, August 27th will be paid a GBX 1.90 ($0.03) dividend. This represents a yield of 1.29%. The ex-dividend date of this dividend is Thursday, August 27th. \n\nIn related news, insider Michael Derbyshire bought 10,000 shares of the company’s stock in a transaction that occurred on Wednesday, June 10th. The shares were purchased at an average cost of GBX 146.94 ($2.26) per share, with a total value of £14,694 ($22,647.97). \n\nCarclo plc is a United Kingdom-based technology led plastics company. The Company is engaged in manufacturing of fine tolerance parts for the Medical,Industrial, Aerospace and Luxury and Supercar Lighting markets. The Company’s operating segments include Carclo Technical Plastics (LON:CAR) manufacture of fine-tolerance moulded plastic components which are used in medical, optical and electronics products; The companies within the LED Technologies and Precisio…","title":"Carclo plc Given Hold Rating at N+1 Singer (CAR)","media-type":"News","source":"MyInforms","published":"2015-09-04T05:42:54Z"}
{"id":"3c8cc0df-fb5c-433f-b30b-0577e8b29b83","content":"When Brian Grey had to figure out the value of a landmark home known as the Flintstone House, the appraiser couldn’t look to comparable residences. With its clump of bubble-shaped rooms, the home seemed to spring out of a Hanna-Barbera c… \r \nSome unusual homes are on the market and making headlines. counterclockwise: The Rock House, the Volcano House, the Flintstone House and Palazzo di Amore COMPOSITE BY MARILYN KALFUS; PHOTOS: JEFF GRITCHEN, LEONARD ORTIZ, MICHAEL McNAMARA, OPEN HOMES PHOTOGRAPHY \n\nSome unusual homes are on the market and making headlines. counterclockwise: The Rock House, the Volcano House, the Flintstone House and Palazzo di AmoreCOMPOSITE BY MARILYN KALFUS; PHOTOS: JEFF GRITCHEN, LEONARD ORTIZ, MICHAEL McNAMARA, OPEN HOMES PHOTOGRAPHY \n\nWhen Brian Grey had to figure out the value of a landmark home known as the Flintstone House, the appraiser couldn’t look to comparable residences. With its clump of bubble-shaped rooms, the home seemed to spring out of a Hanna-Barbera cartoon. \n\nGrey quickly realized, “I just don’t have another house that’s like this. \n\n” \n\nThat didn’t make the property a white elephant, though. \n\nWhen Grey asked several real estate agents in the Bay Area whether there was a market for the unusual home, he recalled, “The consensus was there’s constant demand. \n\n” \n\nSure enough, a buyer snapped it up for $800,000. \n\nNearly two decades later, the quirky marvel – remodeled and enhanced – is on the market again, this time for $4.2 million. \n\nIt’s one of several out-of-the-ordinary dwellings that have been making headlines lately. \n\nIn the Mojave Desert, a house shaped like a spaceship and set on the 150-foot cinder cone of an extinct volcano was listed at $650,000 earlier this month and went into escrow Friday. The property, on 60 acres with a lake, got multiple offers. In Beverly Hills, a sprawling compound touted as the priciest home in the U.S. last year just took a $46 million price cut. \n\nDespite their differences, houses like these raise a common question: How does anyone – real estate professionals, sellers or buyers – figure out what off-the-wall, over-the-top homes are worth? \n\nThe Volcano House was owned by TV personality Huell Howser, who gave it to Chapman University in 2012, a year before his death. The university had originally planned to use the house for desert studies, astronomy and geology pursuits. But it’s selling the property because its desert location, in Newberry Springs east of Barstow, was deemed too isolated for students. \n\nBrady Sandahl of Hom Sotheby’s International Realty says he and another agent listing the house considered other “architecturally significant” properties, mostly in the high desert, in coming up with the $650,000 price tag. \n\n“You just develop a business gut as to what you think the market will capture,” he said. “Then you turn to the buyers, and they’ll tell you why they’re giving you what they’re giving you. That’s the beauty of an open market. \n\n” \n\nSandahl said the multiple offers he received show the asking price was appropriate; three offers came in at $650,000 or more. \n\nBut clearly, the price tag would be higher if the property wasn’t so remote. \n\n“This is real estate,” said Grey, who appraised the Flintstone House. “The first three rules of real estate are location, location, location. \n\n” \n\nThe Flintstone House is on the opposite side of that rule. It’s 17 miles from San Francisco and right near I-280, a major freeway. \n\n“When you’re in the yard of the Flintstone House,” Grey said, “you hear that freeway very clearly. \n\n” \n\nWhile the noise outside the home is a minus, on the plus side, Grey said, the house itself is nearly soundproof: “It’s like being in a cave. \n\n” \n\nHe attributes that to the construction. Steel rebar and wire mesh frames were built over large inflated weather balloons then covered with gunite, or “shotcrete.” He said that makes the walls thicker than a typical home’s. \n\nAppraising even unusual homes involves the basics, Grey said. Size, number of rooms, quality of finishes and condition are all factors considered in addition to location. \n\n“Those are relevant to any house, no matter how unusual or historical or plain it is,” he said. \n\nTHE COMPS \n\nWith no truly comparable homes, Grey said, he used a bracketing system to determine where the Flintstone House fit on a spectrum. He placed the area’s high-end Tudor homes and plain ranch homes at opposite ends. \n\n“Appraising something … it’s quite a bit more art than science,” he said. “In terms of appraising that house, I put it right in the middle. \n\n” \n\nHe did not make comparisons with unusual homes elsewhere in the country, he said. \n\nWith land value varying greatly, he explained, “You could be avoiding an adjustment regarding the design of the house and making a huge adjustment for the difference in location. \n\n” \n\nIn Southern California, Realtors Joyce Rey and Stacy Gottula of Coldwell Banker Previews International cast a considerably wider net to come up with Palazzo di Amore’s $195 million price tag, which has since dropped to $149 million. \n\nThe agents said they looked to the most expensive homes worldwide. \n\nThe 25-acre compound with its own vineyard in Beverly Hills was touted as the most expensive in the U.S. when it came on the market last year. \n\nThe gated, 12-bedroom, 23-bathroom property was eight years in the making. It’s reached by a quarter-mile, tree-lined drive and has a guard station. A two-level entertainment center, with a 50-seat screening room and a bowling alley, is entered through a floating glass-floor walkway over pools lined by 70-year-old olive trees. \n\nThe main residence tops 35,000 square feet, while the entire estate has more than 53,000 square feet of living space. There’s garage parking for 27 cars, though the site “can easily accommodate parking for (approximately) 150 cars,” according to the listing. \n\n“There are so few comps, you really have to look at the history of sales in the area as well as the global sales,” Gottula said. \n\n“They’re going to be a global citizen of some kind,” Rey said of the likely buyers. “They’re going to have houses in various places, and they’re going to be looking, in all probability, in all of those markets. \n\n” \n\nThe Realtors considered the highest sales in London, Hong Kong, France and elsewhere. They …","title":"The Volcano House, Palazzo di Amore, the Flintstone House: What's the real worth of an over-the-top home?","media-type":"News","source":"MyInforms","published":"2015-09-20T04:43:02Z"}
{"id":"d60de2e1-3198-476a-85ec-2bd20b380a9a","content":"Krispy Kreme Doughnuts Inc. saw its stock plummet this week after it reported second-quarter financial results that, despite a 5.6 percent increase in revenue, did not meet earnings expectations.\r\n\r\nLower-than-anticipated sales of packaged food products played a key role in Krispy Kreme (NYSE: KKD) adjusting its financial outlook. The Winston-Salem-based company now expects full-year earnings of 76 cents to 80 cents per share, lower than the 80 cents to 85 cents it projected earlier. In…","title":"Krispy Kreme stock falls after release of 2Q earnings","media-type":"News","source":"MyInforms","published":"2015-09-11T19:25:20Z"}
{"id":"514dca6d-7ca1-4b54-bf27-4c5d8b11adb6","content":"Baker Hughes (NYSE:BHI) has earned an average recommendation of “Buy” from the twenty-seven ratings firms that are covering the firm, MarketBeat reports. One investment analyst has rated the stock with a sell recommendation, eight have given a hold recommendation, fourteen have given a buy recommendation and one has assigned a strong buy recommendation to the… \r \nBaker Hughes (NYSE:BHI) has earned an average recommendation of “Buy” from the twenty-seven ratings firms that are covering the firm, MarketBeat reports. One investment analyst has rated the stock with a sell recommendation, eight have given a hold recommendation, fourteen have given a buy recommendation and one has assigned a strong buy recommendation to the company. The average 1 year target price among brokers that have issued ratings on the stock in the last year is $76.31. \n\nShares of Baker Hughes (NYSE:BHI) traded down 3.29% during trading on Thursday, reaching $53.47. 4,364,462 shares of the company’s stock were exchanged. Baker Hughes has a 52 week low of $44.11 and a 52 week high of $70.45. The firm has a market capitalization of $23.31 billion and a PE ratio of 89.56. The company’s 50-day moving average price is $54.38 and its 200 day moving average price is $61.18. \n\nBaker Hughes (NYSE:BHI) last issued its earnings results on Tuesday, July 21st. The oilfield services provider reported ($0.14) earnings per share for the quarter, missing the Zacks’ consensus estimate of ($0.13) by $0.01. During the same quarter last year, the business earned $0.92 earnings per share. The business had revenue of $3.97 billion for the quarter, compared to the consensus estimate of $3.88 billion. The business’s revenue for the quarter was down 33.1% compared to the same quarter last year. Analysts predict that Baker Hughes will post ($0.32) EPS for the current fiscal year. \n\nThe company also recently announced a quarterly dividend, which will be paid on Wednesday, September 23rd. Investors of record on Wednesday, September 2nd will be given a $0.17 dividend. The ex-dividend date of this dividend is Monday, August 31st. This represents a $0.68 annualized dividend and a yield of 1.27 \n\n%. \n\nA number of analysts have weighed in on the stock. Howard Weil lowered their price target on shares of Baker Hughes from $75.00 to $62.00 in a research report on Thursday. Jefferies Group decreased their target price on shares of Baker Hughes to $68.00 in a research report on Friday, September 11th. JPMorgan Chase & Co. cut their price target on shares of Baker Hughes from $69.00 to $65.00 and set a “neutral” rating for the company in a report on Wednesday, August 26th. Iberia Capital raised shares of Baker Hughes to a “conviction list” rating in a research note on Wednesday, August 26th. Finally, Susquehanna reduced their price target on shares of Baker Hughes from $72.00 to $68.00 and set a “positive” rating for the company in a research report on Monday, August 24th. \n\nIn other news, VP Khalid M. Nouh sold 16,937 shares of the firm’s stock in a transaction on Wednesday, July 22nd. The stock was sold at an average price of $60.73, for a total value of $1,028,584.01. The sale was disclosed in a document filed with the Securities & Exchange Commission, which can be accessed through the SEC…","title":"Brokerages Set Baker Hughes Price Target at $77.26 (NYSE:BHI)","media-type":"News","source":"MyInforms","published":"2015-09-20T14:43:45Z"}
{"id":"5fc5f675-72e6-4cb9-a2a7-8e6dbaeb4ee5","content":"It's been roughly a week since Texans starting inside linebacker Mike Mohamed suffered a calf injury, and he's still experiencing soreness as he works his way… \r \nWhen the Texans got on the scoreboard Sunday with a DeAndre Hopkins touchdown catch, veteran kicker Randy Bullock lined up for his first extra-point attempt of the season and promptly missed it wide right. \n\nIt was the first missed extra point of Bullock’s career after making his previous 66 extra points in his first two NFL seasons. \n\nThis is part of what the NFL intended when it passed a new rule in March moving the extra point back to the 15-yard line. The league wanted to make the play more demanding and encourage NFL teams to increase two-point conversion tries. \n\n“Honestly, I thought I hit it pretty well,” Bullock said Monday. “I hit it pretty well. It just tailed off m…","title":"Texans’ Randy Bullock on missed PAT: ‘That’s the impact of the new rule’","media-type":"News","source":"MyInforms","published":"2015-09-14T17:41:52Z"}
{"id":"16ae73e2-b8a3-4888-a892-9ec7db2bba1c","content":"The original London cast of Dogfight, Pasek and Paul's 2012 musical based on the 1991 film of the same name, is to be reunited at the St James Theatre in a concert staging that will be given two performances Oct. 11. It originally ran in London at Southwark Playhouse in August and September…","title":"Pasek and Paul’s Dogfight Will Get London Concert Reunion","media-type":"News","source":"MyInforms","published":"2015-09-14T17:13:05Z"}
{"id":"0e1d09ed-6ba7-430b-be20-0a3744bfd7b0","content":"CenseoHealth an industry leader of physician-performed health assessment solutions for Medicare Advantage plans, has partnered with Health Insurance Marketplace (HIX) and Commercial plans in 2015 to provide their members health assessments at their home, workplace, primary care physician's office or retail… \r \nPublished on September 4, 2015 at 3:40 AM · No Comments \n\nCenseoHealth an industry leader of physician-performed health assessment solutions for Medicare Advantage plans, has partnered with Health Insurance Marketplace (HIX) and Commercial plans in 2015 to provide their members health assessments at their home, workplace, primary care physician's office or retail clinic. \n\nCenseoHealth is proud to support this new market in their effort to provide quality care to this previously uninsured population. \n\nAccording to a June 2015 RAND Corporation study, the Affordable Care Act provided health insurance coverage to 16.9 million newly insured Americans. With no health history on these individuals, it is critical HIX plans are doing what they can to get their members connected to primary care and case management if needed. \n\nBy partnering with CenseoHealth, HIX plans are able to offer their members quality time with a physician at a location that is convenient for them. Members appreciate the thoroughness of the health assessment and recommendations. With the data collected from the assessment, health plans are then able to better understand the health needs of their members and assist them in navigating their care and recommended preventative services. \n\nSatisfaction with CenseoHealth health assessments is high. The following are testimonials from health plan members who have received a CenseoHealth's physician assessment: \n\n\"I am a retired nurse and I never saw the point in scheduling these visits, but decided to give it a try. The physician diagnosed my husband with a heart problem and advised us to follow up with our primary care physician. When we visited with the doctor, he found the diagnosis to be correct. It is a serious condition and were it not for the CenseoHealth assessment, my husband probably wouldn't be here …","title":"CenseoHealth partners with Health Insurance Marketplace to provide health assessment solutions","media-type":"News","source":"MyInforms","published":"2015-09-04T07:48:57Z"}
{"id":"89ac689b-2139-4fa1-b5c2-b5fdab370ec5","content":"[Vanguard] Abuja -PRESIDENT Muhammed Buhari failed to meet up with his earlier promise of submitting list of nominees to the Senate before the end of September. The president had assured that the list containing the nominees into ministerial offices would be submitted to the Red Chamber latest by September 30,for onward screening and possible… \r \nAbuja — PRESIDENT Muhammed Buhari failed to meet up with his earlier promise of submitting list of nominees to the Senate before the end of September. The president had assured that the list containing the nominees into ministerial offices would be submitted to the Red Chamber latest by September 30,for onward screening and possible confirmation. \n\nBut the Senate President, Bukola Saraki, who announces correspondences from the president at the beginning of plenary, before the consideration of any other items in the day's business, could not announce any letter from the President during Tuesday's session, indicating that there was no such list at his disposal. \n\nThe development prompted the Peoples Democratic Party, PDP senators, through the Minority Leader, Godswill Akpabio, to seek clarification. Akpabio, PDP, Akwa Ibom North West, raised a point of order, under matter of urgent importance, to find out why the Senate President had not announced the president's letter containing ministerial nominees. \n\nAkpabio, who noted that the nation's newspapers in the last couple of weeks, have been awashed with stories of ministerial appointments by the president, asked the Senate President why he received the list from President Buhari and was hiding it from his colleagues. \n\nAs Saraki attempted to answer Akpabio's question, Deputy Senate Leader, Ibn Bala N…","title":"Nigeria: Where is Buhari's List of Ministers?","media-type":"News","source":"MyInforms","published":"2015-09-30T14:15:54Z"}
{"id":"beb15ba3-9329-41c2-913c-448a9668f8d3","content":"Agents with the Federal Bureau of Investigation have served search warrants at the Palm Springs City Hall based on allegations of a crime, according to a local news report.\r\n Read Full Article at… \r \nAgents with the Federal Bureau of Investigation have served search warrants at the Palm Springs City Hall based on allegations of a crime, according to a local news report. \n\nAgents arrived at City Hall at 9 a.m. PT, telling all employees to drop off their work cellphones and exit the building, according to KESQ. The FBI agents said they would be on the scene for hours in the search for evidence. \n\nThe Riverside County District Attorney's Office and agents with the Internal Revenue Service are also on the scene, KESQ reported. \n\nNo one is in…","title":"FBI searches Palm Spring City Hall in relation to criminal activity","media-type":"News","source":"MyInforms","published":"2015-09-01T18:43:03Z"}
{"id":"028c73f4-b181-4efa-999a-3b276ece1994","content":"This decadent vegan cake is inspired by Middle Eastern flavours and is perfect for afternoon… \r \nThis decadent vegan cake is inspired by Middle Eastern flavours and is perfect for afternoon tea \n\nMETHOD \n\nHeat the oven to 160°C (315°F\/Gas 2–3). Oil a 20 cm (8 inch) cake tin and line the base with baking paper. \n\nBeat the oil and sugar together until well combined. Add the yoghurt, orange blossom water, vanilla and orange zest and beat until incorporated. Set aside. \n\nIn a separate bowl, whisk together the ground pistachio nuts, the flours, baking powder, ground cardamom and salt. Gradually add the yoghurt mixture to the flour mixture, alternating with the milk and stirring between each addition until smooth. Be careful not to overbeat. \n\nPour into the prepared tin and bake for about 55 minutes, or until a skewer inserted into the centre comes out clean. If the top starts to brown too much before the cake is cooked, loosely cover with foil. Let the cake stand in the tin for 5 minutes, t…","title":"Pistachio cake with orange blossom water","media-type":"News","source":"MyInforms","published":"2015-09-02T15:38:38Z"}
{"id":"33ede757-4c7e-44ad-86be-c7401061af32","content":"(NEW YORK) — The red planet has space fans red hot with anticipation. NASA said it will announce Monday that a Mars mystery has been “solved,” but did not say what the mystery was, only…\nThe post ‘Mars Mystery Solved': NASA to Announce ‘Major’ News appeared first on… \r \n(NEW YORK) — The red planet has space fans red hot with anticipation. \n\nNASA said it will announce Monday that a Mars mystery has been “solved,” but did not say what the mystery was, only that it “detail a major science finding. \n\n” \n\n“I suspect it’s going to be something that will increase our interest in going to Mars,” former astronaut Mike Massimino said. \n\nSpeculation on social media about what the announcement might be included aliens and water on the planet. Massimino said that if the announcement is that there is water, that could have great significance. \n\n“That there is some sort of life form that might be discovered, and it’s also the…","title":"‘Mars Mystery Solved': NASA to Announce ‘Major’ News","media-type":"News","source":"MyInforms","published":"2015-09-28T13:41:33Z"}
{"id":"cb2baa82-51cd-4cae-a1f4-7c92c4a69a8b","content":"Total (NYSE:TOT) declared a quarterly dividend on Wednesday, September 16th, MarketBeat.com reports. Stockholders of record on Friday, September 25th will be given a dividend of 0.6885 per share by the oil and gas exploration company on Thursday, October 29th. This represents a $2.75 annualized dividend and a dividend yield of 5.80%. The ex-dividend date of […]\nThe post appeared first on Ticker… \r \nTotal (NYSE:TOT) declared a quarterly dividend on Wednesday, September 16th, MarketBeat.com reports. Stockholders of record on Friday, September 25th will be given a dividend of 0.6885 per share by the oil and gas exploration company on Thursday, October 29th. This represents a $2.75 annualized dividend and a dividend yield of 5.80%. The ex-dividend date of this dividend is Wednesday, September 23rd. \n\nShares of Total (NYSE:TOT) traded up 2.09% during trading on Wednesday, reaching $47.47. 2,841,526 shares of the company’s stock traded hands. The company has a 50 day moving average of $47.09 and a 200-day moving average of $49.90. Total has a 1-year low of $40.93 and a 1-year high of $65.30. The company has a market capitalization of $108.57 billion and a price-to-earnings ratio of 31.71. \n\nTotal (NYSE:TOT) last released its quarterly earnings results on Wednesday, July 29th. The oil and gas exploration company reported $1.35 earnings per share for the quarter, topping analysts’ consensus estimates of $1.11 by $0.24. Equities analysts predict that Total will post $4.30 earnings per share for the current year. \n\nSeveral research firms have recently weighed in on TOT. Deutsche Bank raised shares of Total from a “hold” rating to a “buy” rating in a research note on Tuesday, September 1st. Zacks cut shares of Total from a “buy” rating to a “hold” rating in a research report on Friday, July 10th. Cowen and Company dropped their price objective on shares of Total from $60.00 to $58.00 and set an “outperform” rating for the company in a report on Friday, September 11th. Goldman Sachs upgraded shares of Total from a “neutral” rating to a “conviction-buy” rating and lifted their price target for the stock from $40.93 to $45.13 in a research note on Friday, September 11th. Finally, JPMorgan Chase & Co. upgraded shares of Total from a “neutral” rating to an “overweight” rating in a research report on Friday, May 22nd. One equities research analyst has rated the stock with a sell rating, four have assigned a hold rating, seven have issued a buy rating and one has assigned a strong buy rating to the company. The company presently has a consensus rating of “Buy” and an average price target of $55.03. \n\nTotal S.A. is an energy operator. The Company operates through three business segments: an Upstream segmen…","title":"Total S.A. Plans Quarterly Dividend of $0.69 (TOT)","media-type":"News","source":"MyInforms","published":"2015-09-16T22:35:54Z"}
{"id":"ac1b2641-a787-45b6-8ec7-2da7c6e5d5da","content":"One person was seriously burnedHeavy fire was reported in mobile homeCause of fire is under investigation … Click to Continue… \r \nOne person was seriously burned \n\nHeavy fire was reported in mobile home \n\nCause of fire is under investigation \n\nTwo people were injured _ one seriously burned _ Sunday morning in a mobile home fire in far north Fort Worth near the Keller city limit, a fire official said. \n\nThe burned victim was taken by helicopter ambulance to an area hospital, said Battalion Chief Richard Harrison on Sunday morning. \n\nThe other person who suffered burn and smoke inhalation was taken by ambulance to a Fort Worth hospital. \n\nThe names of the injured people were not released. \n\nFirefighters responded to the fire call shortly after 8:30 a.m. Sunday in the 11","title":"Two injured in Fort Worth mobile home fire","media-type":"News","source":"MyInforms","published":"2015-09-20T15:24:10Z"}
{"id":"5032b218-81fe-40c5-befd-5adcb1b2f305","content":"AFC Wimbledon defender Will Nightingale will be out of action for up to seven months after a scan revealed his knee injury was worse than first… \r \nLong road to recovery: Will Nightingale looks likely to be out of action for up to eight months \n\nAFC Wimbledon defender Will Nightingale will be out of action for up to seven months after a scan revealed his knee injury was worse than first believed. \n\nBoss Neal Ardley was hoping the 20-year-old academy product would be out for no more than two months. \n\nHowever, Ardley admitted today that the results of the scan have probably ended Nightingale’s season. \n\nHe told the club’s website: “Will went in for surgery on Thursday evening and when the surgeon took a look at him the knee injury seemed to be a lot worse than the MRI scan had originally shown. \n\n“We initially thought we had a couple of options and the one we were looking to take would have kept him out for…","title":"Football: AFC Wimbledon defender out for the rest of the season","media-type":"News","source":"MyInforms","published":"2015-09-29T11:25:57Z"}
{"id":"0f8a35a2-65ab-4a7d-921f-f05cd433923c","content":"NPR's Linda Wertheimer interviews Thomas Mallon about his new work of historical fiction.  No crowns or bodices here: The book is called Finale: A Novel of the Reagan… \r \nNPR's Linda Wertheimer interviews Thomas Mallon about his new work of historical fiction. No crowns or bodices here","title":"Persons Real And Fictional Puzzle Over Ronald Reagan In 'Finale'","media-type":"News","source":"MyInforms","published":"2015-09-20T11:49:16Z"}
{"id":"6a1efd84-568e-4f27-84b1-0bdaeb9496d3","content":"“MY WAY” Fetty Wap & Drake Dance TUTORIAL | Choreography by Matt Steffanina \n\n▶ TWITTER, INSTAGRAM, VINE » @MattSteffanina @DanceTutorialsLive \n\n▶ Watch the FULL Dance Video Here: https:\/\/youtu.be\/kHLHD2EX8wk \n\nSubscribe for more videos and learn how to dance! Matt teaches weekly classes in Los Angeles at Millennium Dance Complex & IDA Hollywood. For more info on workshops around the world, follow him on social media and sign up for his newsletter at http:\/\/www.MattSteffanina.com \n\n▶ TWITTER – http:\/\/twitter.com\/DanceVidsLive \n\n▶ INSTAGRAM – http:\/\/instagram.com\/DanceTutorialsLIVE \n\n▶ FACEBOOK – http:\/\/facebook.com\/DanceTutorialsLIVE \n\n▶ WEBSITE: http:\/\/dancetutorialslive.com \n\n▶ BOOKING: MattSteffanina@gmail.com \n\n——————————————— \n\nSOCIAL MEDIA, FIND ME \n\n! \n\n—————————————-­—– \n\nMATT’S SOCIAL MEDIA: \n\nTwitter, Instagram & Vine: @MattSteffanina \n\nTWITTER: http:\/\/twitter.com\/MattSteffanina \n\nINSTAGRAM: http:\/\/instagram.com\/MattSteffanina \n\nFACEBOOK: http:\/\/facebook.com\/MattSteffanina \n\nWEBSITE: http:\/\/MattFreestyle.com \n\nBLOG: http:\/\/MattSteffanina.com \n\nGOOGLE+: https:\/\/plus.google.com\/+mattsdance \n\n_____________________________ \n\nOTHER TUTORIALS: \n\nMiley Cyrus – 23 Tutorial: http:\/\/youtu.be\/CHyT5Yuzjf4 \n\nThe Monster – Eminem Tutorial: http:\/\/youtu.be\/hv7l7ShFdbQ \n\nJustin Bieber Tutorial: http:\/\/youtu.be\/2Dpkosaq-uA \n\nBeyonce – Partition Tutorial: http:\/\/youtu.be\/xvTSMvK01eE \n\nMacklemore – Thrift Shop: http:\/\/youtu.be\/wx2GeRP7MlY \n\nArm Waving Tutorial","title":"MY WAY – Fetty Wap ft Drake Dance TUTORIAL | @MattSteffanina Choreography (Int\/Adv Hip Hop)","media-type":"News","source":"MyInforms","published":"2015-09-10T12:13:57Z"}